taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F3xx_DFP.1.4.0.pdsc
    <!-- Startup STM32F334x8 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F334x8 CMSIS">
      <description>System Startup for STMicroelectronics STM32F334x8 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32f334x8.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device/Source/ARM/STM32F3xx_OPT.s"        attr="template" version="1.1.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F318xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F318xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F318xx Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32f318xx.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device/Source/ARM/STM32F3xx_OPT.s"        attr="template" version="1.1.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F328xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F328xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F328xx Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32f328xx.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device/Source/ARM/STM32F3xx_OPT.s"        attr="template" version="1.1.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F358xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F358xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F358xx Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32f358xx.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device/Source/ARM/STM32F3xx_OPT.s"        attr="template" version="1.1.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F378xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F378xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F378xx Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32f378xx.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device/Source/ARM/STM32F3xx_OPT.s"        attr="template" version="1.1.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F398xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32F398xx CMSIS">
      <description>System Startup for STMicroelectronics STM32F398xx Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32f398xx.s" attr="config"   version="1.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_stm32f3xx.c"        attr="config"   version="1.1.0"/>
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device/Source/ARM/STM32F3xx_OPT.s"        attr="template" version="1.1.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- STM32F3-Discovery Board Support -->
    <bundle Cbundle="STM32F3-Discovery" Cclass="Board Support" Cversion="1.0.1">
      <description>STMicroelectronics STM32F3-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F303xC CMSIS">
      <description>LED driver for STMicroelectronics STM32F3-Discovery Board</description>
        <files>
          <file category="source" name="Boards/ST/STM32F3-Discovery/Common/LED_STM32F3-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F303xC CMSIS">
      <description>Button driver for STMicroelectronics STM32F3-Discovery Board</description>
        <files>
        <file category="source" name="Boards/ST/STM32F3-Discovery/Common/Buttons_STM32F3-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F334-Discovery Board Support -->
    <bundle Cbundle="STM32F334-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F334-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F334x8 CMSIS">
      <description>LED driver for STMicroelectronics STM32F334-Discovery Board</description>
        <files>
          <file category="source" name="Boards/ST/STM32F334-Discovery/Common/LED_STM32F334-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F334x8 CMSIS">
      <description>Button driver for STMicroelectronics STM32F3-Discovery Board</description>
        <files>
        <file category="source" name="Boards/ST/STM32F334-Discovery/Common/Buttons_STM32F334-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32373C-EVAL Board Support -->
    <bundle Cbundle="STM32373C-EVAL" Cclass="Board Support" Cversion="1.0.1">
      <description>STMicroelectronics STM32373C-EVAL Board</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="STM32F373xC CMSIS">
        <description>A/D Converter driver for STMicroelectronics STM32373C-EVAL Board</description>
        <files>
          <file category="source" name="Boards/ST/STM32373C-EVAL/Common/SADC_STM32373C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" condition="STM32F373xC CMSIS">
        <description>Graphic LCD driver for STMicroelectronics STM32373C-EVAL Board</description>
        <files>
          <file category="header" name="Boards/ST/STM32373C-EVAL/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/ST/STM32373C-EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/ST/STM32373C-EVAL/Common/GLCD_SPI_STM32373C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F373xC CMSIS">
      <description>Button driver for STMicroelectronics STM32373C-EVAL Board</description>
        <files>
          <file category="source" name="Boards/ST/STM32373C-EVAL/Common/Buttons_STM32373C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F373xC CMSIS">
        <description>LED driver for STMicroelectronics STM32373C-EVAL Board</description>
        <files>
          <file category="source" name="Boards/ST/STM32373C-EVAL/Common/LED_STM32373C-EVAL.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32303C-EVAL Board Support -->
    <bundle Cbundle="STM32303C-EVAL" Cclass="Board Support" Cversion="1.0.1">
      <description>STMicroelectronics STM32303C-EVAL Board</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="STM32F303xC CMSIS">
        <description>A/D Converter driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="Boards/ST/STM32303C-EVAL/Common/ADC_STM32303C-EVAL.c"/>
        </files>
      </component>
